// Conponent
import React, { Component } from 'react';
import { Container, Card } from 'react-bootstrap';
import Contact from './Contact'
import Footer from './Footer';

// Content

export default class AboutMe extends Component {
    render() {
        return <div>
            <Container className='mt-5 p-5'>
                <Card>
                    <Card.Header as="h3">Zismail Dev</Card.Header>
                    <Card.Body>
                        <Card.Title>เกี่ยวกับเรา</Card.Title>
                        <Card.Text>
                            Zismail Dev เป็นสตูดิโอทำสคริปเพื่อคุณภาพ และ การบริการที่ดีที่สุดเท่าที่ลูกค้าจะหาได้ในประเทศ
                            ทางสตูดิโอชอบทำสคริปเองตั้งแต่ต้นไม่ได้มีการเอาของฟรีมาแอบอ้าง หากมีการพัฒนาต่อการระบบที่มีแจกก็จะมีบอกในสินค้า
                            <br />
                            <br />
                            <h5 style={{ color: "red" }}>ข้อตกลงการใช้งานและบริการ</h5>
                            <br />
                            <ul>
                                <li>ห้ามนำสคริปในเซิฟ หรือ ไฟล์เซิฟไปแจกต่อ</li>
                                <li>หากทำไฟล์เซิฟ พัง หรือ หายจะสามารถทักมาขอสคริปใหม่ได้ 2 ครั้ง ถ้าเกินกว่านี้ต้องเสียครึ่งราคาขอสคริปที่เคยซื้อเอาไว</li>
                                <li>หาก ไฟล์ Maindatabase (SQL) ที่ให้ไปพังหรือหาย จะต้องจ่ายเงิน 100 บาทในการทำไฟล์ใหม่ให้</li>
                                <li>หากไฟล์เซิฟมีปัญหาสามารถติดต่อที่ผมได้ จะทำการแก้ไขหรือซ้อมให้ตามความเหมาะสม</li>
                                <li>key หรือ สคริปต่างๆคุณต้องซื้อเองเพื่อจะไม่มีปัญหาในเรื่องผลประโยชน์ของผู้ซื้อเอง</li>
                                <li>หากสคริปไหนที่ผมทำไม่ได้ผมอนุญาติให้บุคคลอื่นเข้ามาแก้เฉพาะในส่วนที่ผมทำไม่ได้ หากเกิดการแก้ไขที่ส่วยอื่นโดนที่ไม่เกี่ยวกับส่วนที่ผมทำไม่ได้ถือว่า หมดสัญญาในการซัตพอตทันทีทุกกรณี</li>
                                <li>การแก้ไขสคริป จะคิดเงินตามความยากของสคริป</li>
                                <br />
                                <h6 style={{ color: "red" }}>หากทำผิดข้อตกลงที่กล่าวไว้จะไม่มีการซับพอต์ใดๆทั้งนั้น และจะถูกขึ้นบัญชีดำของทางร้าน</h6>
                            </ul>
                        </Card.Text>
                    </Card.Body>
                    <Contact />
                </Card>
            </Container>
            <Footer />
        </div>;
    }
}
